Repository: taiten/openssh
Catalog: debian/po/*.po
Languages: pt_br, vi

source: Generate a new configuration file for OpenSSH?
pt_br: Gerar um novo arquivo de configuração para o OpenSSH?
vi: Tao ra tập tin cấu hình mới cho OpenSSH không?

source: This version of OpenSSH has a considerably changed configuration file from the version shipped in Debian 'Potato', which you appear to be upgrading from. This package can now generate a new configuration file (/etc/ssh/sshd.config), which will work with the new server version, but will not contain any customizations you made with the old version.
pt_br: Esta versão do OpenSSH possui um arquivo de configuração consideravelmente diferente da versão fornecida com o Debian 'Potato', a versão do Debian a partir da qual você parece estar atualizando. Este pacote pode agora gerar um novo arquivo de configuração (/etc/ssh/sshd_config), o qual irá funcionar com a nova versão do servidor sshd mas não irá conter nenhuma personalização que você possa ter feito na versão anterior.
vi: Phiên bản OpenSSH này có một tập tin cấu hình đã thay đổi nhiều so với phiên bản có sẵn trong bản phát hành « Potato » của Debian, trong đó có vẻ là bạn đang cập nhật. Gói này giờ có khả năng tạo ra một tập tin cấu hình mới (/etc/ssh/sshd.config), mà sẽ hoạt động được với phiên bản trình phục vụ mới, nhưng không còn chứa mục sửa đổi nào bạn đã tạo trong phiên bản cũ.

source: Please note that this new configuration file will set the value of 'PermitRootLogin' to 'yes' (meaning that anyone knowing the root password can ssh directly in as root). Please read the README.Debian file for more details about this design choice.
pt_br: Por favor, note que este novo arquivo de configuração irá definir o valor da opção 'PermitRootLogin' para 'yes' (o que significa que qualquer pessoa que conheça a senha do root poderá conectar via ssh diretamente como root). Por favor, leia os arquivos README.Debian para maiores detalhes sobre essa escolha de design.
vi: Ghi chú rằng tập tin cấu hình mới này sẽ đặt giá trị của « PermitRootLogin » thành « yes » (có : nghĩa là người nào biết mật khẩu người chủ thì có khả năng truy cập trực tiếp qua ssh với tư cách là người chủ). Xem tập tin Đọc Đi « README.Debian » để tìm thêm chi tiết về sự chọn thiết kế này.

source: It is strongly recommended that you choose to generate a new configuration file now.
pt_br: É fortemente recomendado que você escolha gerar um novo arquivo de configuração agora.
vi: Rất khuyên bạn chọn tạo ra tập tin cấu hình mới ngay bây giờ.

source: Do you want to risk killing active SSH sessions?
pt_br: Você deseja arriscar matar ("kill") as sessões SSH ativas?
vi: Bạn có muốn rủi ro giết phiên bản SSH còn hoạt động không?

source: The currently installed version of /etc/init.d/ssh is likely to kill all running sshd instances. If you are doing this upgrade via an SSH session, you're likely to be disconnected and leave the upgrade procedure unfinished.
pt_br: A versão instalada atualmente de /etc/init.d/ssh está prestes a derrubar todas as instâncias sshd em execução. Se você estiver fazendo esta atualização através de uma sessão SSH, você provavelmente será desconectado e deixará este processo de atualização incompleto.
vi: Phiên bản « /etc/init.d/ssh » được cài đặt hiện thời rất có thể sẽ giết mọi tiến trình sshd đang chạy. Nếu bạn có nâng cấp qua phiên chạy SSH, rất có thể bạn bị ngắt kết nối, để lại tiến trình nâng cấp chưa hoàn tất.

source: This can be fixed by manually adding "--pidfile /var/run/sshd.pid" to the start-stop-daemon line in the stop section of the file.
pt_br: Você pode corrigir isto adicionando "--pidfile /var/run/sshd.pid" na linha start-stop-daemon na seção stop deste arquivo.
vi: Vẫn còn có thể sửa chữa vấn đề này, bằng cách thêm chuỗi « --pidfile /var/run/sshd.pid » vào dòng « start-stop-daemon » (khởi/ngừng chạy trình nền) trong phần « stop » (ngừng chạy) của tập tin đó.

source: New host key mandatory
pt_br: Nova chave de máquina obrigatória
vi: Bắt buộc phải có khoá máy mới

source: The current host key, in /etc/ssh/ssh_host_key, is encrypted with the IDEA algorithm. OpenSSH can not handle this host key file, and the ssh-keygen utility from the old (non-free) SSH installation does not appear to be available.
pt_br: A chave de máquina atual, em /etc/ssh/ssh_host_key, é criptografada utilizando o algoritmo IDEA. O OpenSSH não pode gerenciar esse arquivo de chave de máquina, e o utilitário ssh-keygen da antiga (e não livre) instalação SSH não parece estar disponível.
vi: Khóa máy hiện thời « /etc/ssh/ssh_host_key » được mặt mã bằng thuật toán IDEA. OpenSSH không thể quản lý tập tin khoá máy kiểu này; cũng có vẻ là tiện ích « ssh-keygen » (tạo ra khoá SSH) thuộc về bản cài đặt SSH cũ (khác tự do) không sẵn sàng.

source: You need to manually generate a new host key.
pt_br: Você precisa gerar manualmente uma chave de máquina.
vi: Vậy bạn cần phải tự tạo một khóa máy mới.

source: Disable challenge-response authentication?
pt_br: Desabilitar autenticação desafio-resposta ("challenge-response")?
vi: Tắt khả năng xác thực kiểu yêu cầu/đáp ứng không?

source: Password authentication appears to be disabled in the current OpenSSH server configuration. In order to prevent users from logging in using passwords (perhaps using only public key authentication instead) with recent versions of OpenSSH, you must disable challenge-response authentication, or else ensure that your PAM configuration does not allow Unix password file authentication.
pt_br: A autenticação através de senha parece estar desabilitada em sua configuração atual do servidor OpenSSH. Para que seja possível evitar que usuários se autentiquem utilizando senhas (talvez utilizando somente autenticação através de chaves públicas) em versões recentes do OpenSSH você deve desabilitar a autenticação desafio-resposta ("challenge-response") ou então se certificar que sua configuração PAM não permita autenticação através do arquivos de senhas Unix ("password").
vi: Có vẻ là khả năng xác thực bằng mật khẩu bị tắt trong cấu hình trình phục vụ OpenSSH hiện thời. Để ngăn cản người dùng đăng nhập bằng mật khẩu (có lẽ chỉ xác thực bằng khoá công) với phiên bản OpenSSH gần đây, bạn cần phải tắt khả năng xác thực kiểu yêu cầu/đáp ứng (challenge-response authentication), không thì đảm bảo cấu hình PAM không cho phép xác thực bằng tập tin mật khẩu UNIX.

source: If you disable challenge-response authentication, then users will not be able to log in using passwords. If you leave it enabled (the default answer), then the 'PasswordAuthentication no' option will have no useful effect unless you also adjust your PAM configuration in /etc/pam.d/ssh.
pt_br: Caso você desabilite a autenticação desafio-resposta ("challenge-response"), os usuários não poderão se autenticar utilizando suas senhas. Se você deixá-la habilitada (a resposta padrão), então a opção 'PasswordAuthentication no' não terá efeito útil a menos que você também ajuste sua configuração PAM em /etc/pam.d/ssh.
vi: Nếu bạn tắt khả năng xác thực kiểu yêu cầu/đáp ứng, người dùng sẽ không thể đăng nhập bằng mật khẩu. Để lại hoạt động (trả lời mặc định) thì tùy chọn « PasswordAuthentication no » (xác thực bằng mật khẩu : không) sẽ không có tác động thật, nếu bạn không điều chỉnh cấu hình PAM trong « /etc/pam.d/ssh »
